hms-homelab/hms-mm/mule/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_UART_ISR_IN_IRAM=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# OTA rollback: a newly flashed image boots PENDING_VERIFY and the bootloader
# reverts to the previous slot unless the app marks itself valid. That is the
# safety net for the miner in particular, which has no USB-free recovery path
# of its own.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# URL-pull OTA fetches over https so a GitHub Releases link works directly.
# Plain http:// URLs (a NAS, a laptop) still work and are the lighter path:
# TLS wants ~16 KB of contiguous heap, and this chip has ~50 KB total.
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y

# Verify the server certificate against the bundled root store. This endpoint
# downloads and flashes EXECUTABLE FIRMWARE, so skipping verification would let
# anyone on the network path install arbitrary code on the device. The bundle
# costs flash, which this board has; it does not cost heap at rest.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# Keep the TLS record buffer resident instead of re-allocating it per record.
# With dynamic buffers a long download re-allocates 16 KB repeatedly and fails
# part-way once WiFi RX churn and flash writes have fragmented the heap.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=n

# Phone browsers send enough headers on a form POST to blow the 512 default.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
